gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Lecture des faders (inversés : 4095-0 → 0-255)
  //uint8_t fader1Value = (4095 - analogRead(FADER_1_PIN)) / 16; // 4095-0 → 0-255
  uint8_t fader1Value = 0; // fader1 cassé, on le remplace par 0 en attendant de le réparer
  uint8_t fader2Value = (4095 - analogRead(FADER_2_PIN)) / 16;
  uint8_t fader3Value = (4095 - analogRead(FADER_3_PIN)) / 16;
  
  // Lecture du bouton 3
  bool button3State = !digitalRead(BUTTON_3_PIN);
  
  // Lire les liens des contrôles directement depuis le preset actuel
  uint8_t ir1TargetParam = getParameter("ir1_target_param");
  uint8_t ir2TargetParam = getParameter("ir2_target_param");
  uint8_t fader1TargetParam = getParameter("fader1_target_param");
  uint8_t fader2TargetParam = getParameter("fader2_target_param");
  uint8_t fader3TargetParam = getParameter("fader3_target_param");
  uint8_t button3TargetParam = getParameter("button3_target_param");
  
  // Appliquer les valeurs aux paramètres cibles selon les liens du preset
  if (ir1TargetParam >= 0 && ir1TargetParam < PRESET_SIZE) {
    setParameter(parameters[ir1TargetParam].name, ir1Value);
  }
  
  if (ir2TargetParam >= 0 && ir2TargetParam < PRESET_SIZE) {
    setParameter(parameters[ir2TargetParam].name, ir2Value);
  }
  
      if (fader1TargetParam >= 0 && fader1TargetParam < PRESET_SIZE) {
      setParameter(parameters[fader1TargetParam].name, fader1Value);
    }
    
    if (fader2TargetParam >= 0 && fader2TargetParam < PRESET_SIZE) {
      setParameter(parameters[fader2TargetParam].name, fader2Value);
    }
    
    if (fader3TargetParam >= 0 && fader3TargetParam < PRESET_SIZE) {
      setParameter(parameters[fader3TargetParam].name, fader3Value);
    }


  // Gestion conditionnelle des faders selon l'état du filtre
  //uint8_t filterState = getParameter("filter_on_off"); 

  // if (filterState == 0) {
  //   // Filter OFF : fader1 → vibrato_speed, fader2 → delay_time, fader3 → delay_feedback
  //   setParameter("vibrato_speed", fader1Value);   // Paramètre 3
  //   setParameter("delay_time", fader2Value);      // Paramètre 5
  //   setParameter("delay_feedback", fader3Value);  // Paramètre 6
  // } else {
  //   // Filter ON : utiliser les assignations du preset
  //   if (fader1TargetParam >= 0 && fader1TargetParam < PRESET_SIZE) {
  //     setParameter(parameters[fader1TargetParam].name, fader1Value);
  //   }
    
  //   if (fader2TargetParam >= 0 && fader2TargetParam < PRESET_SIZE) {
  //     setParameter(parameters[fader2TargetParam].name, fader2Value);
  //   }
    
  //   if (fader3TargetParam >= 0 && fader3TargetParam < PRESET_SIZE) {
  //     setParameter(parameters[fader3TargetParam].name, fader3Value);
  //   }
  // }
  
  // Gestion du bouton 3 avec valeurs released/pressed
  if (button3TargetParam > 0 && button3TargetParam < PRESET_SIZE) {
    uint8_t button3ReleasedValue = getParameter("button3_released_value");
    uint8_t button3PressedValue = getParameter("button3_pressed_value");
    uint8_t button3TargetValue = button3State ? button3PressedValue : button3ReleasedValue;
    setParameter(parameters[button3TargetParam].name, button3TargetValue);
  }
  
  // Mettre à jour le dimmer RGB
  updateRGBWithDimmer();
  
  // Debug (optionnel)
  static unsigned long lastDebugTime = 0;
  // if (millis() - lastDebugTime > 1000) { // Debug toutes les secondes
  //   Serial.print("Contrôles - IR1:");
  //   Serial.print(ir1Value);
  //   Serial.print(" IR2:");
  //   Serial.print(ir2Value);
  //   Serial.print(" F1:");
  //   Serial.print(fader1Value);
  //   Serial.print(" F2:");
  //   Serial.print(fader2Value);
  //   Serial.print(" F3:");
  //   Serial.print(fader3Value);
  //   Serial.print(" B3:");
  //   Serial.print(button3State ? "ON" : "OFF");
  //   Serial.println();
  //   lastDebugTime = millis();
  // }
}

// Fonction d'initialisation du rotary encoder (désactivée - encoder non câblé)
/*
void initializeEncoder() {
  // Configuration des pins du rotary encoder
  encoder.attachHalfQuad(ENCODER_A_PIN, ENCODER_B_PIN);
  encoder.setCount(0);
  
  // Configuration du bouton (optionnel)
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);
  
  Serial.println("=== ROTARY ENCODER INITIALISÉ ===");
  Serial.println("Pins configurés:");
  Serial.print("  - Pin A (CLK): D5 (GPIO18)");
  Serial.println(" ✓");
  Serial.print("  - Pin B (DT): D6 (GPIO19)");
  Serial.println(" ✓");
  Serial.print("  - Bouton (SW): D7 (GPIO23)");
  Serial.println(" ✓");
  Serial.println("");
  Serial.println("=== CONTROLES ===");
  Serial.println("🔄 Rotation: Modifie la valeur du paramètre actuel");
  Serial.println("🔘 Bouton: Change de paramètre (cycle 0-19)");
  Serial.println("📊 Monitor: Affiche les changements en temps réel");
  Serial.println("=====================================");
}
*/

// Fonction pour gérer le rotary encoder (désactivée - encoder non câblé)
/*
void handleEncoder() {
  // Lecture de la valeur actuelle du rotary encoder
  int32_t currentEncoderValue = encoder.getCount();
  
  // Si la valeur a changé, mettre à jour le paramètre sélectionné
  if (currentEncoderValue != lastEncoderValue) {
    int32_t delta = currentEncoderValue - lastEncoderValue;
    
    // Obtenir la valeur actuelle du paramètre sélectionné
    uint8_t currentValue = parameters[selectedParameter].value;
    
    // Ajuster la valeur en fonction de la rotation
    int newValue = currentValue + (delta * 2); // Multiplier par 2 pour un contrôle plus sensible
    
    // Limiter la valeur entre 0 et 255
    if (newValue < 0) newValue = 0;
    if (newValue > 255) newValue = 255;
    
    // Mettre à jour le paramètre
    parameters[selectedParameter].value = (uint8_t)newValue;
    dmxValues[parameters[selectedParameter].dmxChannel - 1] = (uint8_t)newValue;
    
    // Afficher les informations détaillées de debug
    Serial.print("🔄 ROTATION: ");
    if (delta > 0) {
      Serial.print("+");
    }
    Serial.print(delta);
    Serial.print(" | Encoder: ");
    Serial.print(currentEncoderValue);
    Serial.print(" | ");
    Serial.print(parameters[selectedParameter].name);
    Serial.print(" (DMX ");
    Serial.print(parameters[selectedParameter].dmxChannel);
    Serial.print("): ");
    Serial.print(currentValue);
    Serial.print(" → ");
    Serial.print((uint8_t)newValue);
    Serial.print(" [");
    Serial.print((uint8_t)newValue * 100 / 255);
    Serial.println("%]");
    
