gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Affichage compact sur une ligne
  Serial.print("IR1 ");
  Serial.print(irRaw1);
  Serial.print(" | IR2 ");
  Serial.print(irRaw2);
  Serial.print(" | F1 ");
  Serial.print(fader1Raw);
  Serial.print(" | F2 ");
  Serial.print(fader2Raw);
  Serial.print(" | F3 ");
  Serial.print(fader3Raw);
  Serial.print(" | B1 ");
  Serial.print(button1State ? "1" : "0");
  Serial.print(" | B2 ");
  Serial.print(button2State ? "1" : "0");
  Serial.print(" | B3 ");
  Serial.print(button3State ? "1" : "0");
  Serial.print(" | ENC ");
  Serial.print(testEncoderValue);
  Serial.print(" | ENCB ");
  Serial.print(encoderButtonState ? "1" : "0");
  Serial.print(" | DMX2 ");
  Serial.print(dmxValues[1]);
  Serial.print(" | DMX3 ");
  Serial.print(dmxValues[2]);
  Serial.print(" | DMX4 ");
  Serial.print(dmxValues[3]);
  Serial.println();
  
  // En mode test, afficher l'encodeur sur les 4 digits
  display.clear();
  uint16_t displayValue = abs(testEncoderValue) % 10000; // Limiter à 4 chiffres
  display.showNumberDec(displayValue);
  
  // Mettre à jour le LED strip avec les valeurs DMX 2, 3, 4
  uint8_t redValue = dmxValues[1];    // Canal DMX 2 (R)
  uint8_t greenValue = dmxValues[2];  // Canal DMX 3 (G) 
  uint8_t blueValue = dmxValues[3];   // Canal DMX 4 (B)
  
  // Appliquer la couleur RGB à tous les LEDs du ruban
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i] = CRGB(redValue, greenValue, blueValue);
  }
  
  // Mettre à jour l'affichage
  FastLED.show();
}



  

  


void loop()
{
  // Incrémenter le compteur d'affichage
  displayCounter++;
  
  if (CONTROL_TEST == 1) {
    // affichage des valeurs brutes des capteurs, boutons, faders, encodeur
    testInputs();
    delay(500);
  }
  else // fonctionnement normal
  {
    // Gestion des contrôles physiques dynamiques (IR1, IR2, faders, bouton3)
    handlePhysicalControls();
    
    // Gestion de l'encodeur rotatif
    handleEncoder();
  }
  
  // Lecture des faders
 // readFaders();
  
  // Gestion des boutons push
  handleButtonInterrupts();
  
  // Gestion du serveur web (limité à 10Hz pour éviter la surcharge)
  static unsigned long lastWebServerUpdate = 0;
  if (millis() - lastWebServerUpdate >= 100) { // 100ms = 10Hz
    webServer.handleClient();
    lastWebServerUpdate = millis();
  }
  
  // Gestion de l'encodeur KY-040
 // handleEncoder();
  
  // Mise à jour de l'afficheur TM1637
  updateDisplay();
  
  // Émission à fréquence fixe (50Hz)
  if (millis() - lastEmissionTime >= EMISSION_INTERVAL) {
    
    setlights();
    sendDMXvalues();
    lastEmissionTime = millis();
  }
  
  delay(1); // Petit délai pour éviter de surcharger le CPU
}

// ============================================================================
// IMPLÉMENTATION DES FONCTIONS DE L'INTERFACE WEB
// ============================================================================

// Initialisation du système de fichiers et du serveur web
void setupWebInterface() {
  // Initialiser le système de fichiers avec formatage forcé si nécessaire
  Serial.println("🔧 Initialisation de LittleFS...");
  if (!LittleFS.begin(true)) {
    Serial.println("❌ Première tentative échouée, formatage forcé...");
    LittleFS.format();
    if (!LittleFS.begin(true)) {
      Serial.println("❌ Erreur: Impossible d'initialiser LittleFS même après formatage");
      return;
    }
  }
  Serial.println("✅ LittleFS initialisé avec succès");
  
  // Vérifier que l'écriture fonctionne en créant un fichier de test
  File testFile = LittleFS.open("/test.txt", "w");
  if (testFile) {
    testFile.println("Test d'écriture LittleFS");
    testFile.close();
    Serial.println("✅ Test d'écriture LittleFS réussi");
    LittleFS.remove("/test.txt"); // Nettoyer le fichier de test
  } else {
    Serial.println("❌ Erreur: Impossible d'écrire dans LittleFS");
  }
  
  // Lister les fichiers disponibles
  File root = LittleFS.open("/");
  File file = root.openNextFile();
  Serial.println("📁 Fichiers disponibles dans LittleFS:");
  while (file) {
    Serial.print("  - ");
    Serial.print(file.name());
    Serial.print(" (");
    Serial.print(file.size());
    Serial.println(" bytes)");
    file = root.openNextFile();
  }
  
  // Créer le point d'accès WiFi
  WiFi.softAP(AP_SSID, AP_PASSWORD);
  Serial.print("📡 Point d'accès WiFi créé: ");
  Serial.println(AP_SSID);
  Serial.print("🔑 Mot de passe: ");
  Serial.println(AP_PASSWORD);
  Serial.print("🌐 Adresse IP: ");
  Serial.println(WiFi.softAPIP());
  
  // Configurer les routes du serveur web
  setupWebRoutes();
  
  // Démarrer le serveur web
  webServer.begin();
  Serial.println("🌐 Serveur web démarré");
  
  // Initialiser les tableaux de presets web
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {
    webPresets[i].name[0] = '\0'; // Marquer les slots comme vides
    webPresets[i].octave = 0;     // Initialiser l'octave à 0
  }
  
  // Charger les presets web et assignations
  Serial.println("🔄 Début du chargement des presets web...");
  loadWebPresets();
  Serial.println("🔄 Début du chargement des assignations web...");
  loadWebAssignments();
}

// Configuration des routes du serveur web
void setupWebRoutes() {
  // Redirection automatique de la racine vers index.html
  webServer.on("/", HTTP_GET, []() {
    webServer.sendHeader("Location", "/index.html", true);
    webServer.send(302, "text/plain", "Redirection vers l'interface web...");
  });
  
  // Route de test simple (pour vérifier que le serveur fonctionne)
  webServer.on("/test", HTTP_GET, []() {
    String html = "<!DOCTYPE html><html><body>";
    html += "<h1>Test DMX Controller</h1>";
    html += "<p>Le serveur web fonctionne !</p>";
    html += "<p>Fichiers LittleFS:</p><ul>";
    
    File root = LittleFS.open("/");
    File file = root.openNextFile();
    while (file) {
      html += "<li>" + String(file.name()) + " (" + String(file.size()) + " bytes)</li>";
      file = root.openNextFile();
    }
    html += "</ul>";

    html += "</body></html>";
    
    webServer.send(200, "text/html", html);
  });
  

  
  // Servir les fichiers statiques depuis LittleFS
  webServer.serveStatic("/", LittleFS, "/");
  
  // API pour récupérer les paramètres
  webServer.on("/api/parameters", HTTP_GET, handleGetParameters);
  
