gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
      // Sauvegarder l'état dans le preset 0 pour persistance
      saveWebStateToPreset0();
      
      DynamicJsonDocument response(1024);
      response["success"] = true;
      response["message"] = "Preset chargé";
      
      // Retourner les vraies valeurs des presets web (pas des paramètres actuels)
      JsonArray paramsArray = response.createNestedArray("parameters");
      for (int i = 0; i < 27; i++) {
        paramsArray.add(webPresets[id].values[i]);
      }
      
      String responseStr;
      serializeJson(response, responseStr);
      webServer.send(200, "application/json", responseStr);
    } else {
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Preset non trouvé ou slot vide\"}");
    }
  } else {
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");
  }
}

// API: Lister les presets web
void handleListWebPresets() {
  DynamicJsonDocument doc(2048);
  JsonArray presetsArray = doc.createNestedArray("presets");
  
  for (int i = 0; i < webPresetCount; i++) {
    JsonObject preset = presetsArray.createNestedObject();
    preset["name"] = webPresets[i].name;
    preset["id"] = i;
  }
  
  String response;
  serializeJson(doc, response);
  webServer.send(200, "application/json", response);
}

// API: Gérer les octaves
void handleOctave() {
  if (webServer.hasArg("plain")) {
    DynamicJsonDocument doc(512);
    deserializeJson(doc, webServer.arg("plain"));
    
    String direction = doc["direction"];
    
    if (direction == "up" && webOctave < 12) {
      webOctave++;
    } else if (direction == "down" && webOctave > -12) {
      webOctave--;
    }
    
    // Appliquer l'octave web directement (système séparé)
    applyWebOctave();
    
    // Afficher l'octave sur l'écran (utiliser webOctave au lieu de transpose)
    if (selectedPreset == 0 && webModeActive) {
      displayUnified();
      
      Serial.print("🎵 Octave web mise à jour: ");
      Serial.println(webOctave);
    }
    
    DynamicJsonDocument response(256);
    response["success"] = true;
    response["octave"] = webOctave;
    response["message"] = "Octave mise à jour";
    
    String responseStr;
    serializeJson(response, responseStr);
    webServer.send(200, "application/json", responseStr);
  } else {
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");
  }
}

// Gestion des erreurs 404
void handleNotFound() {
  String path = webServer.uri();
  Serial.print("❌ 404 - Page non trouvée: ");
  Serial.println(path);
  
  // Vérifier si le fichier existe dans LittleFS
  if (LittleFS.exists(path)) {
    Serial.println("  ⚠️  Le fichier existe dans LittleFS mais n'a pas pu être servi");
  } else {
    Serial.println("  ❌ Le fichier n'existe pas dans LittleFS");
  }
  
  String response = "Page non trouvée: " + path;
  response += "\n\nFichiers disponibles:\n";
  
  // Lister les fichiers disponibles
  File root = LittleFS.open("/");
  File file = root.openNextFile();
  while (file) {
    response += "- " + String(file.name()) + "\n";
    file = root.openNextFile();
  }
  
  webServer.send(404, "text/plain", response);
}




// Sauvegarde des presets web dans LittleFS
void saveWebPresets() {
  File file = LittleFS.open("/web_presets.json", "w");
  if (file) {
    DynamicJsonDocument doc(4096);
    JsonArray presetsArray = doc.createNestedArray("presets");
    
    for (int i = 0; i < MAX_WEB_PRESETS; i++) {
      // Sauvegarder seulement les slots qui contiennent des données
      if (strlen(webPresets[i].name) > 0) {
        JsonObject preset = presetsArray.createNestedObject();
        preset["slot"] = i;  // Sauvegarder le numéro de slot
        preset["name"] = webPresets[i].name;
        preset["octave"] = webPresets[i].octave; // Sauvegarder l'octave
        
        JsonArray valuesArray = preset.createNestedArray("values");
        for (int j = 0; j < 27; j++) {
          valuesArray.add(webPresets[i].values[j]);
        }
      }
    }
    
    serializeJson(doc, file);
    file.close();
    Serial.println("💾 Presets web sauvegardés");
  }
}

// Chargement des presets web depuis LittleFS
void loadWebPresets() {
  Serial.println("🔍 DEBUG: Entrée dans loadWebPresets()");
  
  // Vérifier d'abord si le fichier existe
  Serial.println("🔍 DEBUG: Vérification de l'existence du fichier...");
  bool fileExists = LittleFS.exists("/web_presets.json");
  Serial.print("🔍 DEBUG: LittleFS.exists() retourne: ");
  Serial.println(fileExists ? "TRUE" : "FALSE");
  
  if (!fileExists) {
    Serial.println("📂 Aucun preset web trouvé (première utilisation)");
    webPresetCount = 0;
    Serial.println("🔍 DEBUG: Sortie de loadWebPresets() - fichier n'existe pas");
    return;
  }
  
  Serial.println("🔍 DEBUG: Fichier existe, tentative d'ouverture...");
  File file = LittleFS.open("/web_presets.json", "r");
  Serial.println("🔍 DEBUG: Après appel LittleFS.open()");
  
  if (file) {
    Serial.println("🔍 DEBUG: Fichier ouvert avec succès");
    DynamicJsonDocument doc(4096);
    deserializeJson(doc, file);
    file.close();
    
    JsonArray presetsArray = doc["presets"];
    webPresetCount = 0;
    
    for (JsonObject preset : presetsArray) {
      int slot = preset["slot"]; // Récupérer le numéro de slot
      
      if (slot >= 0 && slot < MAX_WEB_PRESETS) {
        strcpy(webPresets[slot].name, preset["name"]);
        
        // Charger l'octave (défaut à 0 si pas présent pour compatibilité)
        webPresets[slot].octave = preset["octave"] | 0;
        
        JsonArray valuesArray = preset["values"];
        int i = 0;
        for (JsonVariant value : valuesArray) {
          if (i < 27) {
            webPresets[slot].values[i] = value;
            i++;
          }
        }
        
        // Mettre à jour webPresetCount si nécessaire
        if (slot >= webPresetCount) {
          webPresetCount = slot + 1;
        }
      }
    }
    
    Serial.print("📂 ");
    Serial.print(webPresetCount);
    Serial.println(" presets web chargés");
  } else {
    Serial.println("🔍 DEBUG: Impossible d'ouvrir le fichier");
  }
  Serial.println("🔍 DEBUG: Sortie de loadWebPresets()");
}

// Sauvegarde des assignations dans LittleFS
void saveWebAssignments() {
  File file = LittleFS.open("/web_assignments.json", "w");
  if (file) {
    DynamicJsonDocument doc(512);
    JsonArray assignmentsArray = doc.createNestedArray("assignments");
    
